# df 一行中的列表拓展成多行

In [25]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A':['1','a', None],'B':['1', [2,3], [4,5,6]],'C':['1','2','3']}, index=[0,1,3])
print(df)
s = df.apply(lambda column: pd.Series(column['B']),axis=1).stack().reset_index(level=1, drop=True).rename('B',inplace=True)
new_df = df.drop('B', axis=1).join(s).reset_index(drop=True)
new_df.fillna(method='ffill', inplace=True)
new_df

      A          B  C
0     1          1  1
1     a     [2, 3]  2
3  None  [4, 5, 6]  3

   A  C    B
0  1  1    1
1  a  2  2.0
2  a  2  3.0
3  a  3    4
4  a  3  5.0
5  a  3  6.0

In [26]:
df_new = df.explode('B')
new_df

   A  C    B
0  1  1    1
1  a  2  2.0
2  a  2  3.0
3  a  3    4
4  a  3  5.0
5  a  3  6.0

In [9]:
new_df.dropna(subset=['A'])

   A  C    B
0  1  1    1
1  A  2  2.0
2  A  2  3.0
3  A  3    4
4  A  3  5.0
5  A  3  6.0

In [54]:
df.loc[1].index

Index(['A', 'B', 'C'], dtype='object')

## df 按行写成入json

In [2]:
new_df.to_json('df.json', orient='records', lines=True)

In [4]:
new_df['A'].str.replace('A','a')

0    1
1    a
2    a
3    3
4    3
5    3
Name: A, dtype: object

In [2]:
pd.read_json('df.json', orient='records', lines=True)

   A  C  B
0  1  1  1
1  A  2  2
2  A  2  3
3  3  3  4
4  3  3  5
5  3  3  6

In [ ]:
import json
dic={"F1":0.76, "accurcy":0.85, "wrong_index":[4,6]}
print(json.dumps(dic))
fp = open('test.json', 'w')
json.dump(dic,fp)

import pandas as pd
data = pd.read_json('test.json')
data